app/controllers/main_controller.rb

  def index
    home_note = Note.find_by_name("home_info")
---
SELECT * FROM `notes` WHERE (`notes`.`name` = 'home_info') LIMIT 1

  def wine
    @tag = nil
    if(params[:tag] != nil && params[:tag][:id] != nil && params[:tag][:id] != "")
      @tag = Tag.find(params[:tag][:id])
    end
    if @tag == nil
      @tag = Tag.new()
      @tag.name = ""
    end
    @tags = Tag.find(:all).map {  |t| [t.name, t.id]}
    @products = Product.salable_items(@tag.name)
    wine_note = Note.find_by_name("wine_info")
---
SELECT * FROM `notes` WHERE (`notes`.`name` = 'wine_info') LIMIT 1

  def story
    story_note = Note.find_by_name("story_info")
---
SELECT * FROM `notes` WHERE (`notes`.`name` = 'story_info') LIMIT 1

  def events
    @events = Event.event_list
    event_note = Note.find_by_name("event_info")
---
SELECT * FROM `notes` WHERE (`notes`.`name` = 'event_info') LIMIT 1